; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-4-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	p1-2 - location
	p1-7 - location
	p1-11 - location
	p2-10 - location
	p3-5 - location
	p3-6 - location
	p5-0 - location
	p6-0 - location
	p6-1 - location
	p6-4 - location
	p6-11 - location
	p7-5 - location
	p7-9 - location
	p7-10 - location
	p8-1 - location
	p8-7 - location
	p8-9 - location
	p8-11 - location
	p9-10 - location
	p10-3 - location
	p10-6 - location
	p10-8 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s4)
	(at driver3 s11)
	(at driver4 s3)
	(at driver5 s3)
	(at truck1 s9)
	(empty truck1)
	(at truck2 s8)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s11)
	(empty truck4)
	(at package1 s7)
	(at package2 s0)
	(at package3 s11)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 19)
	(= (time-to-walk p1-2 s1) 19)
	(= (time-to-walk s2 p1-2) 32)
	(= (time-to-walk p1-2 s2) 32)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(= (time-to-walk s1 p1-7) 54)
	(= (time-to-walk p1-7 s1) 54)
	(= (time-to-walk s7 p1-7) 5)
	(= (time-to-walk p1-7 s7) 5)
	(path s1 p1-11)
	(path p1-11 s1)
	(path s11 p1-11)
	(path p1-11 s11)
	(= (time-to-walk s1 p1-11) 63)
	(= (time-to-walk p1-11 s1) 63)
	(= (time-to-walk s11 p1-11) 51)
	(= (time-to-walk p1-11 s11) 51)
	(path s2 p2-10)
	(path p2-10 s2)
	(path s10 p2-10)
	(path p2-10 s10)
	(= (time-to-walk s2 p2-10) 78)
	(= (time-to-walk p2-10 s2) 78)
	(= (time-to-walk s10 p2-10) 94)
	(= (time-to-walk p2-10 s10) 94)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 15)
	(= (time-to-walk p3-5 s3) 15)
	(= (time-to-walk s5 p3-5) 4)
	(= (time-to-walk p3-5 s5) 4)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 69)
	(= (time-to-walk p3-6 s3) 69)
	(= (time-to-walk s6 p3-6) 55)
	(= (time-to-walk p3-6 s6) 55)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 81)
	(= (time-to-walk p5-0 s5) 81)
	(= (time-to-walk s0 p5-0) 36)
	(= (time-to-walk p5-0 s0) 36)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(= (time-to-walk s6 p6-0) 70)
	(= (time-to-walk p6-0 s6) 70)
	(= (time-to-walk s0 p6-0) 37)
	(= (time-to-walk p6-0 s0) 37)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 56)
	(= (time-to-walk p6-1 s6) 56)
	(= (time-to-walk s1 p6-1) 78)
	(= (time-to-walk p6-1 s1) 78)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 59)
	(= (time-to-walk p6-4 s6) 59)
	(= (time-to-walk s4 p6-4) 55)
	(= (time-to-walk p6-4 s4) 55)
	(path s6 p6-11)
	(path p6-11 s6)
	(path s11 p6-11)
	(path p6-11 s11)
	(= (time-to-walk s6 p6-11) 25)
	(= (time-to-walk p6-11 s6) 25)
	(= (time-to-walk s11 p6-11) 68)
	(= (time-to-walk p6-11 s11) 68)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(= (time-to-walk s7 p7-5) 19)
	(= (time-to-walk p7-5 s7) 19)
	(= (time-to-walk s5 p7-5) 27)
	(= (time-to-walk p7-5 s5) 27)
	(path s7 p7-9)
	(path p7-9 s7)
	(path s9 p7-9)
	(path p7-9 s9)
	(= (time-to-walk s7 p7-9) 33)
	(= (time-to-walk p7-9 s7) 33)
	(= (time-to-walk s9 p7-9) 22)
	(= (time-to-walk p7-9 s9) 22)
	(path s7 p7-10)
	(path p7-10 s7)
	(path s10 p7-10)
	(path p7-10 s10)
	(= (time-to-walk s7 p7-10) 30)
	(= (time-to-walk p7-10 s7) 30)
	(= (time-to-walk s10 p7-10) 73)
	(= (time-to-walk p7-10 s10) 73)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(= (time-to-walk s8 p8-1) 18)
	(= (time-to-walk p8-1 s8) 18)
	(= (time-to-walk s1 p8-1) 70)
	(= (time-to-walk p8-1 s1) 70)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(= (time-to-walk s8 p8-7) 14)
	(= (time-to-walk p8-7 s8) 14)
	(= (time-to-walk s7 p8-7) 36)
	(= (time-to-walk p8-7 s7) 36)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(= (time-to-walk s8 p8-9) 2)
	(= (time-to-walk p8-9 s8) 2)
	(= (time-to-walk s9 p8-9) 68)
	(= (time-to-walk p8-9 s9) 68)
	(path s8 p8-11)
	(path p8-11 s8)
	(path s11 p8-11)
	(path p8-11 s11)
	(= (time-to-walk s8 p8-11) 40)
	(= (time-to-walk p8-11 s8) 40)
	(= (time-to-walk s11 p8-11) 65)
	(= (time-to-walk p8-11 s11) 65)
	(path s9 p9-10)
	(path p9-10 s9)
	(path s10 p9-10)
	(path p9-10 s10)
	(= (time-to-walk s9 p9-10) 18)
	(= (time-to-walk p9-10 s9) 18)
	(= (time-to-walk s10 p9-10) 18)
	(= (time-to-walk p9-10 s10) 18)
	(path s10 p10-3)
	(path p10-3 s10)
	(path s3 p10-3)
	(path p10-3 s3)
	(= (time-to-walk s10 p10-3) 58)
	(= (time-to-walk p10-3 s10) 58)
	(= (time-to-walk s3 p10-3) 33)
	(= (time-to-walk p10-3 s3) 33)
	(path s10 p10-6)
	(path p10-6 s10)
	(path s6 p10-6)
	(path p10-6 s6)
	(= (time-to-walk s10 p10-6) 21)
	(= (time-to-walk p10-6 s10) 21)
	(= (time-to-walk s6 p10-6) 27)
	(= (time-to-walk p10-6 s6) 27)
	(path s10 p10-8)
	(path p10-8 s10)
	(path s8 p10-8)
	(path p10-8 s8)
	(= (time-to-walk s10 p10-8) 87)
	(= (time-to-walk p10-8 s10) 87)
	(= (time-to-walk s8 p10-8) 2)
	(= (time-to-walk p10-8 s8) 2)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 63)
	(= (time-to-drive s9 s0) 63)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 57)
	(= (time-to-drive s11 s0) 57)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 38)
	(= (time-to-drive s4 s1) 38)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 18)
	(= (time-to-drive s5 s1) 18)
	(link s1 s11)
	(link s11 s1)
	(= (time-to-drive s1 s11) 35)
	(= (time-to-drive s11 s1) 35)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 97)
	(= (time-to-drive s3 s2) 97)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 73)
	(= (time-to-drive s6 s2) 73)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 59)
	(= (time-to-drive s7 s2) 59)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 64)
	(= (time-to-drive s10 s2) 64)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 91)
	(= (time-to-drive s4 s3) 91)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 85)
	(= (time-to-drive s6 s3) 85)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 97)
	(= (time-to-drive s7 s3) 97)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 13)
	(= (time-to-drive s9 s3) 13)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 15)
	(= (time-to-drive s0 s4) 15)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 69)
	(= (time-to-drive s2 s4) 69)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 30)
	(= (time-to-drive s9 s4) 30)
	(link s4 s10)
	(link s10 s4)
	(= (time-to-drive s4 s10) 85)
	(= (time-to-drive s10 s4) 85)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 83)
	(= (time-to-drive s3 s5) 83)
	(link s5 s9)
	(link s9 s5)
	(= (time-to-drive s5 s9) 65)
	(= (time-to-drive s9 s5) 65)
	(link s5 s10)
	(link s10 s5)
	(= (time-to-drive s5 s10) 86)
	(= (time-to-drive s10 s5) 86)
	(link s5 s11)
	(link s11 s5)
	(= (time-to-drive s5 s11) 50)
	(= (time-to-drive s11 s5) 50)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 5)
	(= (time-to-drive s0 s6) 5)
	(link s6 s11)
	(link s11 s6)
	(= (time-to-drive s6 s11) 51)
	(= (time-to-drive s11 s6) 51)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 68)
	(= (time-to-drive s4 s7) 68)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 22)
	(= (time-to-drive s5 s7) 22)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 8)
	(= (time-to-drive s6 s7) 8)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 100)
	(= (time-to-drive s8 s7) 100)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 42)
	(= (time-to-drive s9 s7) 42)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 34)
	(= (time-to-drive s2 s8) 34)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 87)
	(= (time-to-drive s4 s8) 87)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 43)
	(= (time-to-drive s5 s8) 43)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 96)
	(= (time-to-drive s6 s8) 96)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 43)
	(= (time-to-drive s2 s9) 43)
	(link s10 s0)
	(link s0 s10)
	(= (time-to-drive s10 s0) 81)
	(= (time-to-drive s0 s10) 81)
	(link s10 s9)
	(link s9 s10)
	(= (time-to-drive s10 s9) 14)
	(= (time-to-drive s9 s10) 14)
	(link s11 s3)
	(link s3 s11)
	(= (time-to-drive s11 s3) 77)
	(= (time-to-drive s3 s11) 77)
	(link s11 s4)
	(link s4 s11)
	(= (time-to-drive s11 s4) 77)
	(= (time-to-drive s4 s11) 77)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s9)
	(at driver3 s1)
	(at driver4 s11)
	(at truck1 s4)
	(at truck2 s1)
	(at package1 s0)
	(at package2 s0)
	(at package3 s4)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 2  (driven))) (* 2  (walked))))

)

; plan
1. (load-truck package3 truck4 s11)
   deleted: (at package3 s11)
   added: (in package3 truck4)
   goals met: 1 of 8
2. (board-truck driver3 truck4 s11)
   deleted: (at driver3 s11) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 1 of 8
3. (drive-truck truck4 s11 s4 driver3)
   deleted: (at truck4 s11)
   added: (at truck4 s4)
   changed: (driven) from 0 to 77
   goals met: 1 of 8
4. (unload-truck package3 truck4 s4)
   deleted: (in package3 truck4)
   added: (at package3 s4)
   goals met: 2 of 8
5. (drive-truck truck4 s4 s8 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s8)
   changed: (driven) from 77 to 164
   goals met: 2 of 8
6. (walk driver4 s3 p3-6)
   deleted: (at driver4 s3)
   added: (at driver4 p3-6)
   changed: (walked) from 0 to 69
   goals met: 2 of 8
7. (disembark-truck driver3 truck4 s8)
   deleted: (driving driver3 truck4)
   added: (at driver3 s8) (empty truck4)
   goals met: 2 of 8
8. (board-truck driver3 truck2 s8)
   deleted: (at driver3 s8) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 2 of 8
9. (drive-truck truck2 s8 s6 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s6)
   changed: (driven) from 164 to 260
   goals met: 2 of 8
10. (drive-truck truck2 s6 s0 driver3)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (driven) from 260 to 265
   goals met: 2 of 8
11. (walk driver4 p3-6 s6)
   deleted: (at driver4 p3-6)
   added: (at driver4 s6)
   changed: (walked) from 69 to 124
   goals met: 2 of 8
12. (walk driver4 s6 p6-11)
   deleted: (at driver4 s6)
   added: (at driver4 p6-11)
   changed: (walked) from 124 to 149
   goals met: 2 of 8
13. (walk driver4 p6-11 s11)
   deleted: (at driver4 p6-11)
   added: (at driver4 s11)
   changed: (walked) from 149 to 217
   goals met: 3 of 8
14. (disembark-truck driver3 truck2 s0)
   deleted: (driving driver3 truck2)
   added: (at driver3 s0) (empty truck2)
   goals met: 3 of 8
15. (board-truck driver1 truck2 s0)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 3 of 8
16. (drive-truck truck2 s0 s9 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s9)
   changed: (driven) from 265 to 328
   goals met: 3 of 8
17. (drive-truck truck2 s9 s7 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s7)
   changed: (driven) from 328 to 370
   goals met: 3 of 8
18. (walk driver3 s0 p6-0)
   deleted: (at driver3 s0)
   added: (at driver3 p6-0)
   changed: (walked) from 217 to 254
   goals met: 3 of 8
19. (walk driver3 p6-0 s6)
   deleted: (at driver3 p6-0)
   added: (at driver3 s6)
   changed: (walked) from 254 to 324
   goals met: 3 of 8
20. (load-truck package1 truck2 s7)
   deleted: (at package1 s7)
   added: (in package1 truck2)
   goals met: 3 of 8
21. (drive-truck truck2 s7 s9 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s9)
   changed: (driven) from 370 to 412
   goals met: 3 of 8
22. (walk driver3 s6 p6-1)
   deleted: (at driver3 s6)
   added: (at driver3 p6-1)
   changed: (walked) from 324 to 380
   goals met: 3 of 8
23. (walk driver3 p6-1 s1)
   deleted: (at driver3 p6-1)
   added: (at driver3 s1)
   changed: (walked) from 380 to 458
   goals met: 4 of 8
24. (drive-truck truck2 s9 s0 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s0)
   changed: (driven) from 412 to 475
   goals met: 4 of 8
25. (unload-truck package1 truck2 s0)
   deleted: (in package1 truck2)
   added: (at package1 s0)
   goals met: 5 of 8
26. (drive-truck truck2 s0 s11 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s11)
   changed: (driven) from 475 to 532
   goals met: 5 of 8
27. (drive-truck truck2 s11 s1 driver1)
   deleted: (at truck2 s11)
   added: (at truck2 s1)
   changed: (driven) from 532 to 567
   goals met: 6 of 8
28. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 6 of 8
29. (walk driver5 s3 p10-3)
   deleted: (at driver5 s3)
   added: (at driver5 p10-3)
   changed: (walked) from 458 to 491
   goals met: 6 of 8
30. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 6 of 8
31. (walk driver5 p10-3 s10)
   deleted: (at driver5 p10-3)
   added: (at driver5 s10)
   changed: (walked) from 491 to 549
   goals met: 6 of 8
32. (walk driver5 s10 p9-10)
   deleted: (at driver5 s10)
   added: (at driver5 p9-10)
   changed: (walked) from 549 to 567
   goals met: 6 of 8
33. (walk driver5 p9-10 s9)
   deleted: (at driver5 p9-10)
   added: (at driver5 s9)
   changed: (walked) from 567 to 585
   goals met: 6 of 8
34. (board-truck driver5 truck1 s9)
   deleted: (at driver5 s9) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 6 of 8
35. (drive-truck truck1 s9 s4 driver5)
   deleted: (at truck1 s9)
   added: (at truck1 s4)
   changed: (driven) from 567 to 597
   goals met: 7 of 8
36. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 7 of 8
37. (disembark-truck driver5 truck1 s4)
   deleted: (driving driver5 truck1)
   added: (at driver5 s4) (empty truck1)
   goals met: 7 of 8
38. (walk driver1 s1 p8-1)
   deleted: (at driver1 s1)
   added: (at driver1 p8-1)
   changed: (walked) from 585 to 655
   goals met: 7 of 8
39. (walk driver1 p8-1 s8)
   deleted: (at driver1 p8-1)
   added: (at driver1 s8)
   changed: (walked) from 655 to 673
   goals met: 7 of 8
40. (walk driver1 s8 p8-9)
   deleted: (at driver1 s8)
   added: (at driver1 p8-9)
   changed: (walked) from 673 to 675
   goals met: 7 of 8
41. (walk driver1 p8-9 s9)
   deleted: (at driver1 p8-9)
   added: (at driver1 s9)
   changed: (walked) from 675 to 743
   goals met: 8 of 8
